; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v5 ?v9)
             (pred_6 ?v1 ?v3)
             (pred_9 ?v5 ?v3)
             (pred_1 ?v4 ?v5 )
	     (pred_8 ?v5)
             (pred_5 ?v12)
             (pred_12 ?v1)
             (pred_7 ?v3)
             (pred_11 ?v5)
             (pred_4 ?v1)
             (pred_2 ?v5)
             (pred_3 ))



(:action op_5
:parameters (?v10 ?v8 ?v11 ?v13)
:precondition (and (pred_5 ?v10) (pred_5 ?v8) (pred_12 ?v11) (pred_7 ?v13)
          (pred_10 ?v10 ?v8) (pred_6 ?v11 ?v13)
                   (pred_9 ?v8 ?v13) (pred_8 ?v10) 
                   (pred_11 ?v8) (pred_4 ?v11))
:effect (and  (pred_2 ?v8) (not (pred_11 ?v8))))


(:action op_1
:parameters (?v10 ?v2)
:precondition (and (pred_5 ?v10) (pred_5 ?v2)
               (pred_8 ?v10) (pred_10 ?v10 ?v2) (pred_2 ?v2))
:effect (and (pred_8 ?v2) (not (pred_8 ?v10))))

(:action op_4
:parameters (?v10 ?v11)
:precondition (and (pred_5 ?v10) (pred_12 ?v11) 
                  (pred_8 ?v10) (pred_1 ?v11 ?v10) (pred_3 ))
:effect (and (pred_4 ?v11)
   (not (pred_1 ?v11 ?v10)) (not (pred_3 ))))


(:action op_2
:parameters (?v10 ?v7 ?v6)
:precondition (and (pred_5 ?v10) (pred_12 ?v7) (pred_12 ?v6)
                  (pred_8 ?v10) (pred_4 ?v6) (pred_1 ?v7 ?v10))
:effect (and (pred_4 ?v7) (pred_1 ?v6 ?v10)
        (not (pred_4 ?v6)) (not (pred_1 ?v7 ?v10))))

(:action op_3
:parameters (?v10 ?v11)
:precondition (and (pred_5 ?v10) (pred_12 ?v11) 
                  (pred_8 ?v10) (pred_4 ?v11))
:effect (and (pred_3 ) (pred_1 ?v11 ?v10) (not (pred_4 ?v11)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_08 obj_16 obj_26 obj_27 obj_30 obj_21 obj_28 obj_14 obj_09 obj_12 obj_23 obj_22 obj_11 obj_02 obj_13 obj_24 obj_19 obj_29 obj_20 obj_03 obj_01 obj_15 obj_32 obj_06 obj_05
    obj_10 obj_18 obj_07
    obj_17 obj_31 obj_25 obj_04
    )

    (:init
       (pred_3)

       (pred_5 obj_08)
       (pred_5 obj_16)
       (pred_5 obj_26)
       (pred_5 obj_27)
       (pred_5 obj_30)
       (pred_5 obj_21)
       (pred_5 obj_28)
       (pred_5 obj_14)
       (pred_5 obj_09)
       (pred_5 obj_12)
       (pred_5 obj_23)
       (pred_5 obj_22)
       (pred_5 obj_11)
       (pred_5 obj_02)
       (pred_5 obj_13)
       (pred_5 obj_24)
       (pred_5 obj_19)
       (pred_5 obj_29)
       (pred_5 obj_20)
       (pred_5 obj_03)
       (pred_5 obj_01)
       (pred_5 obj_15)
       (pred_5 obj_32)
       (pred_5 obj_06)
       (pred_5 obj_05)
       (pred_7 obj_10)
       (pred_7 obj_18)
       (pred_7 obj_07)
       (pred_12 obj_17)
       (pred_12 obj_31)
       (pred_12 obj_25)
       (pred_12 obj_04)

       (pred_10 obj_08 obj_21)
       (pred_10 obj_08 obj_16)
       (pred_10 obj_16 obj_28)
       (pred_10 obj_16 obj_26)
       (pred_10 obj_16 obj_08)
       (pred_10 obj_26 obj_14)
       (pred_10 obj_26 obj_27)
       (pred_10 obj_26 obj_16)
       (pred_10 obj_27 obj_09)
       (pred_10 obj_27 obj_30)
       (pred_10 obj_27 obj_26)
       (pred_10 obj_30 obj_12)
       (pred_10 obj_30 obj_27)
       (pred_10 obj_21 obj_23)
       (pred_10 obj_21 obj_28)
       (pred_10 obj_21 obj_08)
       (pred_10 obj_28 obj_22)
       (pred_10 obj_28 obj_14)
       (pred_10 obj_28 obj_16)
       (pred_10 obj_28 obj_21)
       (pred_10 obj_14 obj_11)
       (pred_10 obj_14 obj_09)
       (pred_10 obj_14 obj_26)
       (pred_10 obj_14 obj_28)
       (pred_10 obj_09 obj_02)
       (pred_10 obj_09 obj_12)
       (pred_10 obj_09 obj_27)
       (pred_10 obj_09 obj_14)
       (pred_10 obj_12 obj_13)
       (pred_10 obj_12 obj_30)
       (pred_10 obj_12 obj_09)
       (pred_10 obj_23 obj_24)
       (pred_10 obj_23 obj_22)
       (pred_10 obj_23 obj_21)
       (pred_10 obj_22 obj_19)
       (pred_10 obj_22 obj_11)
       (pred_10 obj_22 obj_28)
       (pred_10 obj_22 obj_23)
       (pred_10 obj_11 obj_29)
       (pred_10 obj_11 obj_02)
       (pred_10 obj_11 obj_14)
       (pred_10 obj_11 obj_22)
       (pred_10 obj_02 obj_20)
       (pred_10 obj_02 obj_13)
       (pred_10 obj_02 obj_09)
       (pred_10 obj_02 obj_11)
       (pred_10 obj_13 obj_03)
       (pred_10 obj_13 obj_12)
       (pred_10 obj_13 obj_02)
       (pred_10 obj_24 obj_01)
       (pred_10 obj_24 obj_19)
       (pred_10 obj_24 obj_23)
       (pred_10 obj_19 obj_15)
       (pred_10 obj_19 obj_29)
       (pred_10 obj_19 obj_22)
       (pred_10 obj_19 obj_24)
       (pred_10 obj_29 obj_32)
       (pred_10 obj_29 obj_20)
       (pred_10 obj_29 obj_11)
       (pred_10 obj_29 obj_19)
       (pred_10 obj_20 obj_06)
       (pred_10 obj_20 obj_03)
       (pred_10 obj_20 obj_02)
       (pred_10 obj_20 obj_29)
       (pred_10 obj_03 obj_05)
       (pred_10 obj_03 obj_13)
       (pred_10 obj_03 obj_20)
       (pred_10 obj_01 obj_15)
       (pred_10 obj_01 obj_24)
       (pred_10 obj_15 obj_32)
       (pred_10 obj_15 obj_19)
       (pred_10 obj_15 obj_01)
       (pred_10 obj_32 obj_06)
       (pred_10 obj_32 obj_29)
       (pred_10 obj_32 obj_15)
       (pred_10 obj_06 obj_05)
       (pred_10 obj_06 obj_20)
       (pred_10 obj_06 obj_32)
       (pred_10 obj_05 obj_03)
       (pred_10 obj_05 obj_06)
       (pred_11 obj_15)
       (pred_11 obj_08)
       (pred_11 obj_06)
       (pred_11 obj_32)
       (pred_9  obj_15 obj_10)
       (pred_9  obj_08 obj_18)
       (pred_9  obj_06 obj_07)
       (pred_9  obj_32 obj_10)
       (pred_2 obj_16)
       (pred_2 obj_26)
       (pred_2 obj_27)
       (pred_2 obj_30)
       (pred_2 obj_21)
       (pred_2 obj_28)
       (pred_2 obj_14)
       (pred_2 obj_09)
       (pred_2 obj_12)
       (pred_2 obj_23)
       (pred_2 obj_22)
       (pred_2 obj_11)
       (pred_2 obj_02)
       (pred_2 obj_13)
       (pred_2 obj_24)
       (pred_2 obj_19)
       (pred_2 obj_29)
       (pred_2 obj_20)
       (pred_2 obj_03)
       (pred_2 obj_01)
       (pred_2 obj_05)

       (pred_6  obj_17 obj_10)
       (pred_6  obj_31 obj_18)
       (pred_6  obj_25 obj_07)
       (pred_6  obj_04 obj_10)
       (pred_1 obj_17 obj_09)
       (pred_1 obj_31 obj_27)
       (pred_1 obj_25 obj_12)
       (pred_1 obj_04 obj_27)
       (pred_8 obj_02)
    )

    (:goal (and
       (pred_1 obj_17 obj_11)
       (pred_1 obj_31 obj_02)
    ))
(:constraints
  (always (not (pred_8 obj_14)))
)
)

; plan
1. (op_1 obj_02 obj_09)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_09)
   goals met: 0 of 2
2. (op_4 obj_09 obj_17)
   deleted: (pred_1 obj_17 obj_09) (pred_3)
   added: (pred_4 obj_17)
   goals met: 0 of 2
3. (op_1 obj_09 obj_27)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_27)
   goals met: 0 of 2
4. (op_2 obj_27 obj_31 obj_17)
   deleted: (pred_4 obj_17) (pred_1 obj_31 obj_27)
   added: (pred_4 obj_31) (pred_1 obj_17 obj_27)
   goals met: 0 of 2
5. (op_1 obj_27 obj_09)
   deleted: (pred_8 obj_27)
   added: (pred_8 obj_09)
   goals met: 0 of 2
6. (op_1 obj_09 obj_02)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_02)
   goals met: 0 of 2
7. (op_3 obj_02 obj_31)
   deleted: (pred_4 obj_31)
   added: (pred_3) (pred_1 obj_31 obj_02)
   goals met: 1 of 2
8. (op_1 obj_02 obj_09)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_09)
   goals met: 1 of 2
9. (op_1 obj_09 obj_27)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_27)
   goals met: 1 of 2
10. (op_4 obj_27 obj_17)
   deleted: (pred_1 obj_17 obj_27) (pred_3)
   added: (pred_4 obj_17)
   goals met: 1 of 2
11. (op_1 obj_27 obj_09)
   deleted: (pred_8 obj_27)
   added: (pred_8 obj_09)
   goals met: 1 of 2
12. (op_1 obj_09 obj_02)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_02)
   goals met: 1 of 2
13. (op_1 obj_02 obj_11)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_11)
   goals met: 1 of 2
14. (op_3 obj_11 obj_17)
   deleted: (pred_4 obj_17)
   added: (pred_3) (pred_1 obj_17 obj_11)
   goals met: 2 of 2
